In [90]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [6]:
a = [1,2,3]
b = [4,5]

In [3]:
a+b

[1, 2, 3, 4, 5]

In [7]:
a.extend(b)
a

[1, 2, 3, 4, 5]

In [8]:
x={"a":[1,2,3],"b":[4,5,6],"c":[7,8,9]}
y={"c":[10,11],"d":[12,13]}
x.update(y)
x

{'a': [1, 2, 3], 'b': [4, 5, 6], 'c': [10, 11], 'd': [12, 13]}

In [9]:
?x

Type:        dict
String form: {'a': [1, 2, 3], 'b': [4, 5, 6], 'c': [10, 11], 'd': [12, 13]}
Length:      4
Docstring:
dict() -> new empty dictionary
dict(mapping) -> new dictionary initialized from a mapping object's
    (key, value) pairs
dict(iterable) -> new dictionary initialized as if via:
    d = {}
    for k, v in iterable:
        d[k] = v
dict(**kwargs) -> new dictionary initialized with the name=value pairs
    in the keyword argument list.  For example:  dict(one=1, two=2)

In [10]:
?a

Type:        list
String form: [1, 2, 3, 4, 5]
Length:      5
Docstring:
Built-in mutable sequence.

If no argument is given, the constructor creates a new empty list.
The argument must be an iterable if specified.

In [13]:
%%timeit
n = 100000
sum(range(n))

1.13 ms ± 20.1 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [14]:
%who

a	 b	 n	 np	 pd	 plt	 x	 y

In [15]:
%who function

No variables match your requested type.

In [16]:
%who str

No variables match your requested type.

In [17]:
m = {1,2}
n = {4,5,6}

In [18]:
m | n

{1, 2, 4, 5, 6}

In [20]:
m.union(n)

{1, 2, 4, 5, 6}

In [21]:
height_list=[185,162,171,155,191,166]

In [22]:
height_series=pd.Series(height_list)
print(height_series)

0    185
1    162
2    171
3    155
4    191
5    166
dtype: int64

In [23]:
?height_series

Type:        Series
String form:
0    185
1    162
2    171
3    155
4    191
5    166
dtype: int64
Length:      6
File:        /opt/conda/lib/python3.9/site-packages/pandas/core/series.py
Docstring:
One-dimensional ndarray with axis labels (including time series).

Labels need not be unique but must be a hashable type. The object
supports both integer- and label-based indexing and provides a host of
methods for performing operations involving the index. Statistical
methods from ndarray have been overridden to automatically exclude
missing data (currently represented as NaN).

Operations between Series (+, -, /, \*, \*\*) align values based on their
associated index values-- they need not be the same length. The result
index will be the sorted union of the two indexes.

Parameters
----------
data : array-like, Iterable, dict, or scalar value
    Contains data stored in Series. If data is a dict, argument order is
    maintained.
index : array-like or Index (1d)
    Values must be hashable and have the same length as `data`.
    Non-unique index values are allowed. Will default to
    RangeIndex (0, 1, 2, ..., n) if not provided. If data is dict-like
    and index is None, then the keys in the data are used as the index. If the
    index is not None, the resulting Series is reindexed with the index values.
dtype : str, numpy.dtype, or ExtensionDtype, optional
    Data type for the output Series. If not specified, this will be
    inferred from `data`.
    See the :ref:`user guide <basics.dtypes>` for more usages.
name : str, optional
    The name to give to the Series.
copy : bool, default False
    Copy input data. Only affects Series or 1d ndarray input. See examples.

Examples
--------
Constructing Series from a dictionary with an Index specified

>>> d = {'a': 1, 'b': 2, 'c': 3}
>>> ser = pd.Series(data=d, index=['a', 'b', 'c'])
>>> ser
a   1
b   2
c   3
dtype: int64

The keys of the dictionary match with the Index values, hence the Index
values have no effect.

>>> d = {'a': 1, 'b': 2, 'c': 3}
>>> ser = pd.Series(data=d, index=['x', 'y', 'z'])
>>> ser
x   NaN
y   NaN
z   NaN
dtype: float64

Note that the Index is first build with the keys from the dictionary.
After this the Series is reindexed with the given Index values, hence we
get all NaN as a result.

Constructing Series from a list with `copy=False`.

>>> r = [1, 2]
>>> ser = pd.Series(r, copy=False)
>>> ser.iloc[0] = 999
>>> r
[1, 2]
>>> ser
0    999
1      2
dtype: int64

Due to input data type the Series has a `copy` of
the original data even though `copy=False`, so
the data is unchanged.

Constructing Series from a 1d ndarray with `copy=False`.

>>> r = np.array([1, 2])
>>> ser = pd.Series(r, copy=False)
>>> ser.iloc[0] = 999
>>> r
array([999,   2])
>>> ser
0    999
1      2
dtype: int64

Due to input data type the Series has a `view` on
the original data, so
the data is changed as well.

In [24]:
weight_arr=np.array([72,51,69,55,87,78])
weight_series=pd.Series(weight_arr)
print(weight_series)

0    72
1    51
2    69
3    55
4    87
5    78
dtype: int64

In [25]:
ser = pd.Series([1,2,3],name='some series')
print(ser)

0    1
1    2
2    3
Name: some series, dtype: int64

In [26]:
print(ser.index)

RangeIndex(start=0, stop=3, step=1)

In [27]:
dic = {'T':185,'H':162,'B':171,'R':155,'M':191,'S':166}
ser = pd.Series(dic)
print(ser)

T    185
H    162
B    171
R    155
M    191
S    166
dtype: int64

In [28]:
dic={'a':0,'b':1,'c':2}
a = pd.Series(dic,index=['a','b','c','d'])
print(a)

a    0.0
b    1.0
c    2.0
d    NaN
dtype: float64

In [29]:
pd.Series(10,index=['A','B','C'])

A    10
B    10
C    10
dtype: int64

In [30]:
list('afd')

['a', 'f', 'd']

In [39]:
ser = pd.Series([1,2,3,4,5],index=['A','B','C','D','E'])

In [40]:
ser

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [41]:
ser + 1

A    2
B    3
C    4
D    5
E    6
dtype: int64

In [43]:
ser[ser > 3]

D    4
E    5
dtype: int64

In [37]:
ser[1]

2

In [44]:
ser['A']

1

In [45]:
ser.iloc[0]

1

In [46]:
ser2 = pd.Series([4,5,6,7],index=['D','E','F','G'])

In [48]:
ser + ser2

A     NaN
B     NaN
C     NaN
D     8.0
E    10.0
F     NaN
G     NaN
dtype: float64

In [49]:
ser.dtype

dtype('int64')

In [54]:
ser.loc['A']

1

In [55]:
pd.Series(['a','b','c'])

0    a
1    b
2    c
dtype: object

In [56]:
pd.Series(['a','b','c'], dtype='category')

0    a
1    b
2    c
dtype: category
Categories (3, object): ['a', 'b', 'c']

In [58]:
ser.append(ser2,ignore_index=True)

/tmp/ipykernel_78/811431912.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ser.append(ser2,ignore_index=True)

0    1
1    2
2    3
3    4
4    5
5    4
6    5
7    6
8    7
dtype: int64

In [65]:
pd.concat([ser,ser2],ignore_index=True)

0    1
1    2
2    3
3    4
4    5
5    4
6    5
7    6
8    7
dtype: int64

In [66]:
ser.append(ser2)

/tmp/ipykernel_78/1352812209.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ser.append(ser2)

A    1
B    2
C    3
D    4
E    5
D    4
E    5
F    6
G    7
dtype: int64

In [67]:
ser=pd.Series([1,1,2,2,2,3,4,5,6,6])

In [68]:
ser.drop_duplicates()

0    1
2    2
5    3
6    4
7    5
8    6
dtype: int64

In [69]:
ser.drop_duplicates(keep='first')

0    1
2    2
5    3
6    4
7    5
8    6
dtype: int64

In [70]:
ser.drop_duplicates(keep=False)

5    3
6    4
7    5
dtype: int64

In [71]:
ser.drop_duplicates(keep='last')

1    1
4    2
5    3
6    4
7    5
9    6
dtype: int64

In [75]:
ser=pd.Series([1,np.nan,np.nan,4,np.nan],index=list('abcde'))

In [78]:
ser[ser.isna()]

b   NaN
c   NaN
e   NaN
dtype: float64

In [79]:
ser[ser.notna()]

a    1.0
d    4.0
dtype: float64

In [80]:
ser.dropna()

a    1.0
d    4.0
dtype: float64

In [81]:
pd.DataFrame(['a',1,0.5])

     0
0    a
1    1
2  0.5

In [82]:
pd.DataFrame([[1,2,3],[4,5,6]],index=['a','b'],columns=['c','d','e'])

   c  d  e
a  1  2  3
b  4  5  6

In [83]:
pd.DataFrame([[1,2,3],[4,5]],index=['a','b'],columns=['c','d','e'])

   c  d    e
a  1  2  3.0
b  4  5  NaN

In [85]:
pd.DataFrame({'a':[1,2,3],'b':[4,5,6]})

   a  b
0  1  4
1  2  5
2  3  6

In [92]:
age = pd.Series([10,12,9], index=['A','B','C'])
sex = pd.Series(['M','F','F'], index=['C','A','D'])
pd.DataFrame({'age':age,'sex':sex})

    age  sex
A  10.0    F
B  12.0  NaN
C   9.0    M
D   NaN    F

In [93]:
pd.DataFrame({'age':{'A':10,'B':12,'C':9},'sex':{'C':'M','A':'F','D':'F'}})

    age  sex
A  10.0    F
B  12.0  NaN
C   9.0    M
D   NaN    F

In [95]:
df = pd.DataFrame({
    'math':[82,93,77],
    'eng':[77,87,71],
    'chem':[69,91,89]
})
df

   math  eng  chem
0    82   77    69
1    93   87    91
2    77   71    89

In [96]:
df['math']

0    82
1    93
2    77
Name: math, dtype: int64

In [97]:
df[['math','eng']]

   math  eng
0    82   77
1    93   87
2    77   71

In [98]:
df[df['math'] > 80]

   math  eng  chem
0    82   77    69
1    93   87    91

In [99]:
df = pd.DataFrame([[1,2,3],[4,5,6]])
df.index

RangeIndex(start=0, stop=2, step=1)

In [100]:
df.index = ['a','b']

In [101]:
df.index

Index(['a', 'b'], dtype='object')

In [104]:
df.columns

Index(['c', 'd', 'e'], dtype='object')

In [103]:
df.columns = ['c','d','e']

In [109]:
df.loc['b','e']

6

In [110]:
df.iloc[0,:]

c    1
d    2
e    3
Name: a, dtype: int64

In [111]:
df.iloc[1,2]

6

In [112]:
df.shape

(2, 3)

In [113]:
df.size

6

In [116]:
df

   c    d  e
a  1    2  3
b  4  100  6

In [115]:
df.iloc[1,1]=100

In [118]:
df['new1'] = 10
df

   c    d  e  new1
a  1    2  3    10
b  4  100  6    10

In [119]:
df['new2'] = [5,6]
df

   c    d  e  new1  new2
a  1    2  3    10     5
b  4  100  6    10     6

In [135]:
df = pd.DataFrame([[1,2,3],[4,5,6]])
df['new1'] = 10
df['new2'] = [5,6]
df.append(pd.Series([7,8,9,10,11],index=[0,1,2,'new1','new2'],name='new3'))

/tmp/ipykernel_78/1159892806.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(pd.Series([7,8,9,10,11],index=[0,1,2,'new1','new2'],name='new3'))

      0  1  2  new1  new2
0     1  2  3    10     5
1     4  5  6    10     6
new3  7  8  9    10    11

In [140]:
pd.concat([df,pd.DataFrame([pd.Series([7,8,9,10,11],index=[0,1,2,'new1','new2'],name='new3')])])

      0  1  2  new1  new2
0     1  2  3    10     5
1     4  5  6    10     6
new3  7  8  9    10    11

In [141]:
pd.DataFrame([pd.Series([7,8,9])])

   0  1  2
0  7  8  9

In [142]:
pd.DataFrame(pd.Series([7,8,9]))

   0
0  7
1  8
2  9

In [144]:
df = pd.DataFrame([[1,2,3],[4,5,6]],index=['x','y'], columns=['A','B','C'])
df

   A  B  C
x  1  2  3
y  4  5  6

In [149]:
df = pd.DataFrame([[1,2,3],[4,5,6]],index=['x','y'], columns=['A','B','C'])

In [150]:
df.drop(labels='x',axis=0)

   A  B  C
y  4  5  6

In [151]:
df

   A  B  C
x  1  2  3
y  4  5  6

In [154]:
df.drop(labels=['A','C'],axis=1)

   B
x  2
y  5

In [155]:
df=pd.DataFrame([[1,2,3],[4,5,6],[1,2,3],[3,5,6],[1,2,3]],columns=list('ABC'))

In [156]:
df

   A  B  C
0  1  2  3
1  4  5  6
2  1  2  3
3  3  5  6
4  1  2  3

In [157]:
df.duplicated(keep='first')

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [158]:
df[df.duplicated(keep='first')]

   A  B  C
2  1  2  3
4  1  2  3

In [159]:
df.drop_duplicates(keep='first') #

   A  B  C
0  1  2  3
1  4  5  6
3  3  5  6

In [160]:
df=pd.DataFrame([[1,2,3],[4,5,np.nan],[1,np.nan,np.nan],[3,5,6],[7,8,9]],columns=list('ABC'))
df

   A    B    C
0  1  2.0  3.0
1  4  5.0  NaN
2  1  NaN  NaN
3  3  5.0  6.0
4  7  8.0  9.0

In [162]:
df.notna()

      A      B      C
0  True   True   True
1  True   True  False
2  True  False  False
3  True   True   True
4  True   True   True

In [163]:
df.dropna(axis=1)

   A
0  1
1  4
2  1
3  3
4  7

In [164]:
df.dropna(axis=0)

   A    B    C
0  1  2.0  3.0
3  3  5.0  6.0
4  7  8.0  9.0

In [166]:
idx1 = pd.Index([1,7,2,3,5])
idx2 = pd.Index([3,4,1,5,6])
print(idx1)
print(idx2)
print(idx1 & idx2)
print(idx1 | idx2)

Int64Index([1, 7, 2, 3, 5], dtype='int64')
Int64Index([3, 4, 1, 5, 6], dtype='int64')
Int64Index([1, 3, 5], dtype='int64')
Int64Index([1, 2, 3, 4, 5, 6, 7], dtype='int64')

/tmp/ipykernel_78/1240479521.py:5: FutureWarning: Index.__and__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__and__.  Use index.intersection(other) instead.
  print(idx1 & idx2)
/tmp/ipykernel_78/1240479521.py:6: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead.
  print(idx1 | idx2)

In [167]:
print(idx1.intersection(idx2))

Int64Index([1, 3, 5], dtype='int64')

In [168]:
print(idx1.union(idx2))

Int64Index([1, 2, 3, 4, 5, 6, 7], dtype='int64')

In [169]:
pd.DataFrame([1,2,3]).index

RangeIndex(start=0, stop=3, step=1)

In [170]:
pd.DataFrame([1,2,3],index=[0,1,2]).index

Int64Index([0, 1, 2], dtype='int64')

In [171]:
pd.DatetimeIndex(freq='D',start='2018-12-28',end='2019-01-05')

TypeError: __new__() got an unexpected keyword argument 'start'

In [172]:
pd.__version__

'1.4.2'

In [173]:
dates = pd.date_range(freq='D',start='2018-12-28',end='2019-01-05')

In [175]:
df_date = pd.DataFrame([1,2,3,4,5,6,7,8,9],index=dates)
df_date

            0
2018-12-28  1
2018-12-29  2
2018-12-30  3
2018-12-31  4
2019-01-01  5
2019-01-02  6
2019-01-03  7
2019-01-04  8
2019-01-05  9

In [176]:
df_date['2019']

/tmp/ipykernel_78/664392422.py:1: FutureWarning: Indexing a DataFrame with a datetimelike index using a single string to slice the rows, like `frame[string]`, is deprecated and will be removed in a future version. Use `frame.loc[string]` instead.
  df_date['2019']

            0
2019-01-01  5
2019-01-02  6
2019-01-03  7
2019-01-04  8
2019-01-05  9

In [177]:
df_date.loc['2019']

            0
2019-01-01  5
2019-01-02  6
2019-01-03  7
2019-01-04  8
2019-01-05  9

In [178]:
df_date.index

DatetimeIndex(['2018-12-28', '2018-12-29', '2018-12-30', '2018-12-31',
               '2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05'],
              dtype='datetime64[ns]', freq='D')

In [179]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],index=[0,2,4],columns=['a','b','c'])
df

   a  b  c
0  1  2  3
2  4  5  6
4  7  8  9

In [184]:
df1 = df.reindex([0,1,2,3,4])
df1

     a    b    c
0  1.0  2.0  3.0
1  NaN  NaN  NaN
2  4.0  5.0  6.0
3  NaN  NaN  NaN
4  7.0  8.0  9.0

In [186]:
df1.index=[5,6,7,8,9]
df1

     a    b    c
5  1.0  2.0  3.0
6  NaN  NaN  NaN
7  4.0  5.0  6.0
8  NaN  NaN  NaN
9  7.0  8.0  9.0

In [188]:
df2 = df1.reindex(columns=['a','b','c','d'])
df2

     a    b    c   d
5  1.0  2.0  3.0 NaN
6  NaN  NaN  NaN NaN
7  4.0  5.0  6.0 NaN
8  NaN  NaN  NaN NaN
9  7.0  8.0  9.0 NaN

In [190]:
df3 = df2.reindex([5,6,7,8,9,10],method='ffill')
df3

      a    b    c   d
5   1.0  2.0  3.0 NaN
6   NaN  NaN  NaN NaN
7   4.0  5.0  6.0 NaN
8   NaN  NaN  NaN NaN
9   7.0  8.0  9.0 NaN
10  7.0  8.0  9.0 NaN

In [192]:
ser = pd.Series([1,2,3],index=pd.Index(['い','あ','う']))
ser

い    1
あ    2
う    3
dtype: int64

In [193]:
ser.sort_index()

あ    2
い    1
う    3
dtype: int64

In [195]:
domain = 'https://archive.ics.uci.edu'
path = '/ml/machine-learning-databases/adult/'
file = 'adult.data'
df = pd.read_csv(domain + path + file, header=None, skipinitialspace=True)

In [197]:
df.iloc[0:2]

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K

In [198]:
df.shape

(32561, 15)

In [201]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       32561 non-null  int64
 1   1       32561 non-null  object
 2   2       32561 non-null  int64
 3   3       32561 non-null  object
 4   4       32561 non-null  int64
 5   5       32561 non-null  object
 6   6       32561 non-null  object
 7   7       32561 non-null  object
 8   8       32561 non-null  object
 9   9       32561 non-null  object
 10  10      32561 non-null  int64
 11  11      32561 non-null  int64
 12  12      32561 non-null  int64
 13  13      32561 non-null  object
 14  14      32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [204]:
df[[1,4]].describe() # 統計量

                  4
count  32561.000000
mean      10.080679
std        2.572720
min        1.000000
25%        9.000000
50%       10.000000
75%       12.000000
max       16.000000